In [1]:
print("Hola Mundo, esta es mi primera incursión en Python")

Hola Mundo, esta es mi primera incursión en Python

In [2]:
nombre = "Luis Porras"
edad = 30
actividades = [
    "programar",
    "ver peliculas o series",
    "salir a pasear con mi esposa"
]
mascotas = False

In [3]:
print(nombre)

Luis Porras

In [4]:
print(edad)

30

In [5]:
print(actividades[1])

ver peliculas o series

In [6]:
print(mascotas)

False

In [7]:
print(type(nombre))

<class 'str'>

In [8]:
print(type(edad))

<class 'int'>

In [9]:
print(type(actividades))

<class 'list'>

In [10]:
print(type(mascotas))

<class 'bool'>

In [11]:
print(nombre, edad, actividades, mascotas)

Luis Porras 30 ['programar', 'ver peliculas o series', 'salir a pasear con mi esposa'] False

In [12]:
print('Estaba la pájara pinta sentada en el verde limón')
# La falla era que hacía falta una commilla simple

Estaba la pájara pinta sentada en el verde limón

In [13]:
print('Mi nombre es', nombre, 'y tengo', edad, 'años')
# El error es que hacían falta las comas para realizar la interpolación de los datos,
# además la variable name no existia

Mi nombre es Luis Porras y tengo 30 años

In [14]:
import pandas as pd
import numpy as np
# El error es que los nombres de las librerias pandas y numpy estaban incorrectos

In [15]:
print("Ornitorrinco", 45)
# No se puede sumar un numero con un string
# se agregó un print y una interpolacion con coma

Ornitorrinco 45

In [16]:
df = pd.read_csv('flights.csv')

In [17]:
df.head(5)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [18]:
df.tail(5)

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [19]:
df['year'].describe()

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

In [20]:
df['month'].value_counts()

May          12
December     12
February     12
October      12
January      12
August       12
March        12
September    12
April        12
November     12
July         12
June         12
Name: month, dtype: int64

In [21]:
df['year'].value_counts()

1960    12
1959    12
1958    12
1957    12
1956    12
1955    12
1954    12
1953    12
1952    12
1951    12
1950    12
1949    12
Name: year, dtype: int64

In [22]:
first_15 = df.head(15)
last_15 = df.tail(15)

In [23]:
first_15

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141

In [24]:
last_15

     year      month  passengers
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [25]:
mean_passengers = np.mean(df['passengers'])
print(mean_passengers)

280.2986111111111

In [26]:
median_passengers = np.median(df['passengers'])
print(median_passengers)

265.5

In [27]:
std_passengers = np.std(df['passengers'])
print(std_passengers)

119.54904153277148

In [28]:
mean_first_15_passengers = np.mean(first_15['passengers'])
print (mean_first_15_passengers)

126.8

In [29]:
median_first_15_passengers = np.median(first_15['passengers'])
print (median_first_15_passengers)

126.0

In [30]:
std_first_15_passengers = np.std(first_15['passengers'])
print(std_first_15_passengers)

12.681745410891462

In [31]:
mean_last_15_passengers = np.mean(last_15['passengers'])
print (mean_last_15_passengers)

459.2

In [32]:
median_last_15_passengers = np.median(last_15['passengers'])
print (median_last_15_passengers)

432.0

In [38]:
std_last_15_passengers = np.std(last_15['passengers'])
print(std_last_15_passengers)

75.29426715671431

In [35]:
#La media de los 15 primeros pasajeros es de 126.8
# La mediana es de 126.0
# y la desviación estandar es de 12.68
# Dado que la desviación estandar es alta, se puede decir que los datos están
# alejados de la media

In [40]:
# La media de los últimos 15 pasajeros es de 459.2
# La mediana es de 459.2
# La desviación estandar es 75.294
# Dado que la desviación estandar es alta, se puede decir que los datos están
# alejados de la media